{
    "common": {
        "name": "ble",
        "version": "0.13.0",
        "news": {
            "0.13.0": {
                "en": "The option to allow recording new devices is now available in the config dialog. When the adapter starts, it will be disabled, and when enabled, it will be automatically disabled after 5 minutes (#730, #729)\nFix: RSSI will now be updated, even if it was unchanged (#493)\nDependency updates, lots of dependency updates...",
                "de": "Die Option, das Aufzeichnen neuer Geräte zuzulassen, ist jetzt im Konfigurationsdialog verfügbar. Wenn der Adapter startet, wird sie deaktiviert, und wenn sie aktiviert ist, wird sie nach 5 Minuten automatisch deaktiviert (#730, #729)\nFix: RSSI wird jetzt aktualisiert, auch wenn es unverändert war (#493)\nAbhängigkeiten aktualisiert",
                "ru": "Опция, позволяющая записывать новые устройства, теперь доступна в диалоговом окне конфигурации. При запуске адаптера он будет отключен, а при включении автоматически отключится через 5 минут (#730, #729)\nИсправлено: RSSI теперь будет обновляться, даже если он не изменился (# 493)\nОбновления зависимостей, множество обновлений зависимостей...",
                "pt": "A opção de permitir a gravação de novos dispositivos agora está disponível na caixa de diálogo de configuração. Quando o adaptador for iniciado, ele será desabilitado e, quando habilitado, será desabilitado automaticamente após 5 minutos (#730, #729)\nCorreção: RSSI agora será atualizado, mesmo que não tenha sido alterado (#493)\nAtualizações de dependências, muitas atualizações de dependências...",
                "nl": "De optie om het opnemen van nieuwe apparaten toe te staan is nu beschikbaar in de configuratiedialoog. Wanneer de adapter start, wordt deze uitgeschakeld en wanneer ingeschakeld, wordt deze na 5 minuten automatisch uitgeschakeld (#730, #729)\nOplossing: RSSI wordt nu bijgewerkt, zelfs als deze ongewijzigd was (#493)\nAfhankelijkheidsupdates, veel afhankelijkheidsupdates...",
                "fr": "L'option permettant d'enregistrer de nouveaux appareils est désormais disponible dans la boîte de dialogue de configuration. Lorsque l'adaptateur démarre, il sera désactivé, et lorsqu'il est activé, il sera automatiquement désactivé après 5 minutes (#730, #729)\nCorrection : RSSI sera désormais mis à jour, même s'il était inchangé (#493)\nMises à jour des dépendances, beaucoup de mises à jour des dépendances...",
                "it": "L'opzione per consentire la registrazione di nuovi dispositivi è ora disponibile nella finestra di dialogo di configurazione. Quando l'adattatore si avvia, verrà disabilitato e, una volta abilitato, verrà automaticamente disabilitato dopo 5 minuti (#730, #729)\nCorrezione: RSSI ora verrà aggiornato, anche se era invariato (#493)\nAggiornamenti delle dipendenze, molti aggiornamenti delle dipendenze...",
                "es": "La opción para permitir la grabación de nuevos dispositivos ahora está disponible en el cuadro de diálogo de configuración. Cuando se inicia el adaptador, se desactivará y, cuando se active, se desactivará automáticamente después de 5 minutos (#730, #729)\nSolución: RSSI ahora se actualizará, incluso si no se modificó (# 493)\nActualizaciones de dependencia, muchas actualizaciones de dependencia...",
                "pl": "Opcja pozwalająca na nagrywanie nowych urządzeń jest teraz dostępna w oknie konfiguracji. Po uruchomieniu adapter zostanie wyłączony, a po włączeniu zostanie automatycznie wyłączony po 5 minutach (#730, #729)\nPoprawka: RSSI zostanie teraz zaktualizowany, nawet jeśli był niezmieniony (#493)\nAktualizacje zależności, wiele aktualizacji zależności...",
                "zh-cn": "现在可以在配置对话框中使用允许录制新设备的选项。适配器启动时会被禁用，启用时会在5分钟后自动禁用（#730、#729）\n修复：RSSI 现在将被更新，即使它没有改变 (#493)\n依赖更新，大量依赖更新......"
            },
            "0.12.0": {
                "en": "Scanning is now done in a separate process, so uncatchable errors in `noble` no longer bring down the main process",
                "de": "Das Scannen erfolgt jetzt in einem separaten Prozess, sodass nicht abfangbare Fehler in \"nobel\" den Hauptprozess nicht mehr zum Erliegen bringen",
                "ru": "Сканирование теперь выполняется в отдельном процессе, поэтому неисправимые ошибки в `noble` больше не прерывают основной процесс.",
                "pt": "A digitalização agora é feita em um processo separado, portanto, erros não detectáveis em `noble` não desligam mais o processo principal",
                "nl": "Het scannen gebeurt nu in een apart proces, dus niet te vinden fouten in `noble` brengen het hoofdproces niet langer naar beneden",
                "fr": "La numérisation est maintenant effectuée dans un processus séparé, de sorte que les erreurs incontrôlables dans `noble` ne font plus tomber le processus principal",
                "it": "La scansione ora viene eseguita in un processo separato, quindi gli errori non rilevabili in \"nobile\" non fanno più cadere il processo principale",
                "es": "El escaneo ahora se realiza en un proceso separado, por lo que los errores irrecuperables en `noble` ya no derriban el proceso principal",
                "pl": "Skanowanie jest teraz wykonywane w osobnym procesie, więc niemożliwe do wykrycia błędy w elemencie „noble” nie spowodują już obniżenia głównego procesu",
                "zh-cn": "现在，扫描是在一个单独的过程中完成的，因此“ noble”中不可捕获的错误不再使主要过程中断"
            },
            "0.11.8": {
                "en": "The pressure value reported by Ruuvi Tags is now parsed with two decimal places",
                "de": "Der von Ruuvi Tags gemeldete Druckwert wird jetzt mit zwei Dezimalstellen analysiert",
                "ru": "Значение давления, сообщаемое тегами Ruuvi, теперь анализируется с двумя десятичными знаками.",
                "pt": "O valor de pressão relatado por Ruuvi Tags agora é analisado com duas casas decimais",
                "nl": "De drukwaarde die door Ruuvi Tags wordt gerapporteerd, wordt nu geparseerd met twee decimalen",
                "fr": "La valeur de pression rapportée par Ruuvi Tags est maintenant analysée avec deux décimales",
                "it": "Il valore di pressione riportato da Ruuvi Tags viene ora analizzato con due cifre decimali",
                "es": "El valor de presión informado por Ruuvi Tags ahora se analiza con dos lugares decimales",
                "pl": "Wartość ciśnienia zgłaszana przez Ruuvi Tags jest teraz analizowana z dwoma miejscami po przecinku",
                "zh-cn": "Ruuvi标签报告的压力值现在解析为两个小数位"
            },
            "0.11.7": {
                "en": "Added a more helpful error message if the adapter terminates with error `EAFNOSUPPORT`",
                "de": "Eine hilfreichere Fehlermeldung wurde hinzugefügt, wenn der Adapter mit dem Fehler \"EAFNOSUPPORT\" beendet wird",
                "ru": "Добавлено более полезное сообщение об ошибке, если адаптер завершает работу с ошибкой `EAFNOSUPPORT`",
                "pt": "Adicionada uma mensagem de erro mais útil se o adaptador terminar com o erro `EAFNOSUPPORT`",
                "nl": "Een nuttiger foutbericht toegevoegd als de adapter eindigt met de fout 'EAFNOSUPPORT'",
                "fr": "Ajout d'un message d'erreur plus utile si l'adaptateur se termine par l'erreur `EAFNOSUPPORT`",
                "it": "Aggiunto un messaggio di errore più utile se l'adattatore termina con l'errore \"EAFNOSUPPORT\"",
                "es": "Se agregó un mensaje de error más útil si el adaptador termina con el error `EAFNOSUPPORT`",
                "pl": "Dodano bardziej pomocny komunikat o błędzie, jeśli adapter kończy pracę z błędem `EAFNOSUPPORT`",
                "zh-cn": "如果适配器以错误“ EAFNOSUPPORT”终止，则添加了更有用的错误消息"
            },
            "0.11.6": {
                "en": "* Ignore unhandled out of range error somewhere in `noble`",
                "de": "* Ignorieren Sie nicht behandelte Fehler außerhalb des Bereichs irgendwo in `noble`",
                "ru": "* Игнорировать необработанную ошибку вне диапазона где-то в `noble`",
                "pt": "* Ignore o erro não tratado fora do intervalo em algum lugar nobre",
                "nl": "* Negeer onverwerkte fout buiten bereik ergens in `noble`",
                "fr": "* Ignorer l'erreur hors de portée non gérée quelque part dans `noble`",
                "it": "* Ignora l'errore non gestito fuori portata da qualche parte in \"nobile\"",
                "es": "* Ignora el error fuera de rango no manejado en algún lugar de `noble`",
                "pl": "* Zignoruj nieobsługiwany błąd przekroczenia zakresu gdzieś w `noble`",
                "zh-cn": "* 忽略`noble`中某处未处理的超出范围的错误"
            },
            "0.11.4": {
                "en": "* Utilize JS-Controller's auto module rebuild if possible",
                "de": "* Verwenden Sie nach Möglichkeit die automatische Modulwiederherstellung von JS-Controller",
                "ru": "* Используйте автоматическую перестройку JS-контроллера, если это возможно",
                "pt": "* Utilize a reconstrução automática do módulo do controlador JS, se possível",
                "nl": "* Gebruik indien mogelijk de automatische herbouw van de JS-Controller",
                "fr": "* Utilisez la reconstruction automatique du module JS-Controller si possible",
                "it": "* Utilizzare la ricostruzione automatica del modulo di JS-Controller, se possibile",
                "es": "* Utilice la reconstrucción automática del módulo JS-Controller si es posible",
                "pl": "* Wykorzystaj automatyczną przebudowę modułu JS-Controller, jeśli to możliwe",
                "zh-cn": "* 尽可能利用JS-Controller的自动模块重建"
            },
            "0.11.3": {
                "en": "* Fixed a crash that happens when `noble` can not be loaded.",
                "de": "* Es wurde ein Absturz behoben, der auftrat, wenn \"noble\" nicht geladen werden konnte.",
                "ru": "* Исправлен сбой, который происходит, когда `noble` не может быть загружен.",
                "pt": "* Corrigida uma falha que acontece quando o `noble` não pode ser carregado.",
                "nl": "* Een crash gerepareerd die optreedt wanneer `noble` niet kan worden geladen.",
                "fr": "* Correction d'un plantage qui se produit lorsque `noble` ne peut pas être chargé.",
                "it": "* Risolto un crash che si verificava quando \"nobile\" non può essere caricato.",
                "es": "* Se corrigió un bloqueo que ocurre cuando no se puede cargar `noble`.",
                "pl": "* Naprawiono awarię występującą, gdy nie można załadować „szlachetnego”.",
                "zh-cn": "* 修复了无法加载`noble`时发生的崩溃。"
            }
        },
        "title": "Bluetooth Low Energy (BLE)",
        "titleLang": {
            "en": "Bluetooth Low Energy (BLE)",
            "de": "Bluetooth-Niedrigenergie (BLE)",
            "ru": "Bluetooth с низким энергопотреблением (BLE)",
            "pt": "Bluetooth de baixa energia (BLE)",
            "nl": "Bluetooth lage energie (BLE)",
            "fr": "Bluetooth à faible consommation d'énergie (BLE)",
            "it": "Bluetooth a bassa energia (BLE)",
            "es": "Bluetooth de baja energía (BLE)",
            "pl": "Niskoenergetyczna łączność Bluetooth (BLE)",
            "zh-cn": "低功耗蓝牙 (BLE)"
        },
        "desc": {
            "en": "Monitor Bluetooth Low Energy (BLE) beacons",
            "de": "Überwacht Bluetooth Low Energy (BLE) beacons",
            "ru": "Монитор Bluetooth низкой энергии (BLE) маяки",
            "pt": "Monitor de Bluetooth Low Energy (BLE) beacons",
            "nl": "Monitor Bluetooth Low Energy (BLE) beacons",
            "fr": "Moniteur Bluetooth Low Energy (BLE) balises",
            "it": "Monitor Bluetooth Low Energy (BLE) beacon",
            "es": "Monitor de Bluetooth de Baja Energía (BLE) las balizas",
            "pl": "Monitor Bluetooth low energy (BLE) latarnie",
            "zh-cn": "监测蓝牙低能源(BLE)信标"
        },
        "authors": ["AlCalzone <d.griesel@gmx.net>"],
        "platform": "Javascript/Node.js",
        "license": "MIT",
        "main": "build/main.js",
        "mode": "daemon",
        "icon": "ble.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/AlCalzone/ioBroker.ble/master/admin/ble.png",
        "keywords": ["bluetooth", "BLE", "beacon"],
        "readme": "https://github.com/AlCalzone/ioBroker.ble/blob/master/README.md",
        "loglevel": "info",
        "type": "hardware",
        "messagebox": true,
        "compact": false,
        "materialize": true,
        "dependencies": [
            {
                "js-controller": ">=1.4.2"
            }
        ],
        "osDependencies": {
            "linux": [
                "bluetooth",
                "bluez",
                "libbluetooth-dev",
                "libudev-dev",
                "libcap2-bin"
            ]
        }
    },
    "native": {
        "services": "",
        "hciDevice": 0,
        "plugins": "",
        "allowEmptyDevices": false,
        "rssiThrottle": 0
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Adapter-Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If BLE scan is active",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        },
        {
            "_id": "info.driverState",
            "type": "state",
            "common": {
                "role": "indicator.state",
                "name": "bluetooth driver state",
                "desc": "The current state of the bluetooth driver",
                "type": "string",
                "read": true,
                "write": false,
                "def": "poweredOff"
            },
            "native": {}
        },
        {
            "_id": "options",
            "type": "channel",
            "common": {
                "name": "Adapter-Optionen"
            },
            "native": {}
        },
        {
            "_id": "options.allowNewDevices",
            "type": "state",
            "common": {
                "role": "switch",
                "name": "Allow new devices",
                "desc": "Whether new devices should be recorded or not",
                "type": "boolean",
                "read": true,
                "write": true,
                "def": false
            },
            "native": {}
        }
    ]
}
